---
type: LightGroup
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 7
tags: [revit-api, class]
---

# LightGroup

`Autodesk.Revit.DB.Lighting.LightGroup` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddLight | 2013 | `public void AddLight ( ElementId lightId )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetLights | 2013 | `public ICollection < ElementId > GetLights ()` |
| Method | RemoveLight | 2013 | `public void RemoveLight ( ElementId lightId )` |
| Property | Id | 2013 | `public ElementId Id { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2013 | `public string Name { get ; set ; }` |